Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G59B.tmx
Source language: en_us
Languages: zh_cn

source: PEACEMAKER HERO: DAN ELDON
zh_cn: 我心目中的英雄之丹·艾登

source: "Never give in, never give in, never ever ever give in!"
zh_cn: “永不屈服，永不屈服，决不，决不！”

source: These strong words by Winston Churchill became part of a mantra that helped to sustain Kathy Eldon after her son's tragic death.
zh_cn: 在儿子不幸遇难之后，凯西·艾登正是靠着温斯顿·丘吉尔这句振聋发聩的口号支撑下来的。

source: Kathy Eldon's work today is greatly inspired by her son, Dan Eldon.
zh_cn: 凯西·艾登现在的工作灵感主要是被儿子丹·艾登激发起来的。

source: Dan Eldon, an artist, poet, humanitarian and photojournalist was stoned to death in Somalia, Africa, in July of 1993 by an angry mob reacting to the United Nations bombing raid on the suspected headquarters of General Aidid. He was twenty-two.
zh_cn: 丹·艾登，身兼艺术家、诗人、人道主义者、新闻摄影记者多种头衔。1993年7月，丹·艾登被一群反对美国对穆罕默德·拉法赫·艾迪德疑似总部狂轰乱炸的激愤暴徒投石砸死，年仅22岁。

source: Kathy Eldon spoke about Dan for MY HERO.
zh_cn: 凯西·艾登接受了《我的偶像》的访谈。

source: "I'm a little bit cautious about the word, "hero," because everyone's a hero. We all have that potential.
zh_cn: “我对‘英雄’一词的定义很谨慎，因为每个人都有可能成为英雄。

source: Heroes have a sense of light about them, I think, or should.
zh_cn: 我觉得英雄的头顶一定或者应该有着光环。

source: They make us feel that we can be bigger than we thought we ever could be.
zh_cn: 以他们为榜样，我们会觉得自己比之前想象的要强大许多。

source: I think in a curious way, Dan saw the hero in other people.
zh_cn: 我有一个奇怪的想法，丹发现了沉睡在别人内心的英雄。

source: He saw the qualities that we all maybe have inside us, but we've forgotten about or we don't believe in.
zh_cn: 他看到了每个人潜在的品质，那些连我们自己都忽视、自认为没有的品质。

source: Dan saw the magic and the potential in people and I think that's a wonderful quality to have, and to do that at such a young age is really very special."
zh_cn: 丹发现了人身上的潜能和奇迹，而我相信这正是他所拥有的最美品质，能够在年轻的时候就有如此作为，实在是异于常人。

source: Dan was allowed to guide his unconventional life with his own light.
zh_cn: 丹能够遵从自己的意愿，拥有非传统化的生活方式。

source: He was always working to help people, finding new and unusual ways to offer support.
zh_cn: 他努力地助人，寻觅新而独特的方法来给予帮助。

source: One such effort that Kathy described was Dan's co-founding "The Student Transport Aid," dedicated to helping the refugees fleeing Mozambique.
zh_cn: 凯西描述道，其中一项成就就是丹与他人联合举办的“运输学生援助计划”，旨在帮助莫桑比克难民。

source: In his journal, Dan stated his objectives for the trip that he and thirteen other young people took across Africa to deliver their aid:
zh_cn: 在日记中，丹说出了自己与另外十三个年轻人开赴非洲实施援助的目的：

source: "Team Deziree" Free at Last Voyages, the Search for Clean Water in a Swamp: Mission Statement for Safari as a Way of Life...
zh_cn: “Team Deziree"要在最后的旅程里获得自由——在沼泽寻找洁净水源：让行走成为生命的常态...

source: To explore the unknown and the familiar, distant and near, and to record in detail with the eyes of a child, any beauty of the flesh or otherwise, horror, irony, traces of utopia or Hell.
zh_cn: 探寻已知或未知的领域，无论路途遥远还是短暂。以赤子之心仔细记录下人类美丽的瞬间，记录不堪与丑恶，不管这条路通往乌托邦还是地狱。

source: Select your team with care, but when in doubt, take on new crew and give them a chance.
zh_cn: 与志同道合者并肩，当猜疑来临时，勇于接纳新人，给他们一次展现的机会。

source: But avoid at all costs fluctuations of sincerity with your best people."
zh_cn: 同时做到用人不疑。

source: One of the "best people" who joined Dan on his "Team Deziree" trek across Africa was his little sister, Amy Eldon.
zh_cn: 跟随丹“Team Deziree"穿越非洲的优秀成员之一是他的小妹妹艾米·艾登。

source: She was Dan's favorite model, cherished confidante and dearest friend.
zh_cn: 她是丹最爱的偶像，珍视的红颜知己和挚友。

source: She was fifteen years old when she accompanied her brother on this adventure.
zh_cn: 艾米加入哥哥此次冒险旅程的时候，年仅十五岁。

source: And Dan's heroes?
zh_cn: 丹的偶像们？

source: Kathy explained, "He had many.
zh_cn: 凯西解释道，“他有许多偶像。

source: You'd be hearing a music mix coming from his room and suddenly Martin Luther King, Jr.'s voice: 'I have been to the top of the mountain...' you know. Stunning.
zh_cn: 你会听到一阵音乐伴奏从他的房间传出来，紧接着传来马丁路德金的声音：‘我曾站在山顶上......’你知道的，让人大吃一惊。

source: Bob Marley was a great hero of Dan's along with Gandhi, Churchill and Ralph Waldo Emerson. (He) specifically (liked) Emerson's Recipe for Success in Life...we found it in his things.
zh_cn: 鲍勃·玛丽、甘地、丘吉尔、拉尔夫·瓦尔多·艾默生。 特别喜欢艾默生的《人生的成功秘诀》...我们在收拾他遗物时发现的。

source: Also Dedan Kimathi...who was killed during the Mau Mau Period in Kenya."
zh_cn: 还有德丹·基马蒂，肯尼亚茅茅运动里被杀的那个人。”

source: The loss of a son, which would have crushed so many, is now giving meaning to many people.
zh_cn: 丧子之痛本该将一个母亲彻底击倒，现在却向人们传达了更多意义。

source: One of Kathy's many projects that has been inspired by his life is a feature film.
zh_cn: 凯西被儿子激发出来的工作项目之一是一部故事片。

source: Kathy explained: "I thought it would be exciting to take this model of a life...who was not perfect, he was not a Sunday school teacher ...take that life and be able to show it to younger people and say...Hey, it's possible to be sexy and hip and funky and amazing and also to care about others.
zh_cn: 凯西说：“我觉得把他作为一生的榜样能够振奋人心。尽管他并不完美，不是周末补习班老师，但是他用自己的生命向年轻人证明了，在变得性感时髦令人艳羡的同时也可以关心一下其他人。

source: To do things that are kind, to be aware of the power that an individual has to affect change in the world.
zh_cn: 做于世界有益的事，要相信个人的力量也足以改变世界。

source: To live passionately, but also compassionately...with awareness of suffering.
zh_cn: 轰轰烈烈地活，同时不失对他人的同情心，做好受苦受难的准备。

source: We want to make a film that is REAL, a true story told with integrity."
zh_cn: 我们想制作一部真实而完整的故事片。”

source: When asked what she'd learned from Dan since he passed into spirit world, Kathy said, "I've learned that people can have a profound influence even after they're not physically around.
zh_cn: 当采访问道她从丹的离世中收获了什么，凯西说：“我知道了，即使一个人不存在于这个世界上，他的影响仍然存在。

source: Dan's energy and spirit...he was like a comet...he TOOK OFF -- but the sparks from that comet continue to set fires in people and I think will continue to do so for a very long time.
zh_cn: 丹的能量和精神，他就像一颗彗星，匆匆离去，但是他一闪而过的光芒仍然留存在人们心中，而我相信，还能留存得更久。

source: I now believe that energy does remain and that physical death is not a total death.
zh_cn: 我现在终于相信精神永存，身体的死亡并不是生命的中介。

source: I think our spirits have a life after the physical death....
zh_cn: 我想我们的精神仍然永葆生机。

source: so I've learned a lot."
zh_cn: 所以，我感悟到很多。”
